juanmalk/FW-ContikiOS/contiki_fw_framework_m2wsns/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_ccfg.h
// Field:     [8] WRT_PROT_SEC_40
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_40                        0x00000100
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_40_BITN                            8
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_40_M                      0x00000100
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_40_S                               8

// Field:     [7] WRT_PROT_SEC_39
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_39                        0x00000080
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_39_BITN                            7
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_39_M                      0x00000080
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_39_S                               7

// Field:     [6] WRT_PROT_SEC_38
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_38                        0x00000040
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_38_BITN                            6
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_38_M                      0x00000040
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_38_S                               6

// Field:     [5] WRT_PROT_SEC_37
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_37                        0x00000020
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_37_BITN                            5
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_37_M                      0x00000020
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_37_S                               5

// Field:     [4] WRT_PROT_SEC_36
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_36                        0x00000010
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_36_BITN                            4
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_36_M                      0x00000010
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_36_S                               4

// Field:     [3] WRT_PROT_SEC_35
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_35                        0x00000008
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_35_BITN                            3
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_35_M                      0x00000008
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_35_S                               3

// Field:     [2] WRT_PROT_SEC_34
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_34                        0x00000004
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_34_BITN                            2
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_34_M                      0x00000004
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_34_S                               2

// Field:     [1] WRT_PROT_SEC_33
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_33                        0x00000002
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_33_BITN                            1
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_33_M                      0x00000002
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_33_S                               1

// Field:     [0] WRT_PROT_SEC_32
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_32                        0x00000001
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_32_BITN                            0
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_32_M                      0x00000001
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_32_S                               0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_95_64
//
//*****************************************************************************
// Field:    [31] WRT_PROT_SEC_95
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_95                        0x80000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_95_BITN                           31
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_95_M                      0x80000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_95_S                              31

// Field:    [30] WRT_PROT_SEC_94
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_94                        0x40000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_94_BITN                           30
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_94_M                      0x40000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_94_S                              30

// Field:    [29] WRT_PROT_SEC_93
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_93                        0x20000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_93_BITN                           29
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_93_M                      0x20000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_93_S                              29

// Field:    [28] WRT_PROT_SEC_92
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_92                        0x10000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_92_BITN                           28
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_92_M                      0x10000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_92_S                              28

// Field:    [27] WRT_PROT_SEC_91
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_91                        0x08000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_91_BITN                           27
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_91_M                      0x08000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_91_S                              27

// Field:    [26] WRT_PROT_SEC_90
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_90                        0x04000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_90_BITN                           26
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_90_M                      0x04000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_90_S                              26

// Field:    [25] WRT_PROT_SEC_89
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_89                        0x02000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_89_BITN                           25
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_89_M                      0x02000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_89_S                              25

// Field:    [24] WRT_PROT_SEC_88
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_88                        0x01000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_88_BITN                           24
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_88_M                      0x01000000
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_88_S                              24

